robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3_6/src/2FOC - Copy.c
        if (MotorConfig.has_qe)
        {
            if (MotorConfig.has_hall)
            {
                unsigned int poscnt = QEgetRaw();
                static unsigned int poscnt_old = 0xFFFF;
                if (poscnt_old == poscnt)
                {
                    if (sector_stored_old != sector)
                    {
                        gEncoderError.phase_broken = TRUE;
                        SysError.EncoderFault = TRUE;
                        FaultConditionsHandler();
                    }
                }
                else
                {
                    poscnt_old = poscnt;
                }

                if (sector==1 && sector_stored==6) // positive
                {
                    enc_start_sec = enc+30;
                    if (enc_start_sec >=360) enc_start_sec -=360;
                }
                else if (sector==6 && sector_stored==1) // negative
                {
                    enc_start_sec = enc-30;
                    if (enc_start_sec <   0) enc_start_sec +=360;
                }
                else if (sector>sector_stored)
                { // positive rotation
                    enc_start_sec = enc+30;
                    if (enc_start_sec >=360) enc_start_sec -=360;
                }
                else
                { // negative rotation
                    enc_start_sec = enc-30;
                    if (enc_start_sec <   0) enc_start_sec +=360;
                }
            }
        }

        sector_stored_old = sector_stored;
        sector_stored = sector;

        #define HI(Ix,Vx) iH = &(ParkParm.Ix); ppwmH = &Vx;
        #define LO(Ix,Vx) iL = &(ParkParm.Ix); ppwmL = &Vx;
        #define NE(Ix,Vx) i0 = &(ParkParm.Ix); ppwm0 = &Vx;

        switch (sector) // original
        {
            case 1: HI(qIa,Va) LO(qIb,Vb) NE(qIc,Vc) break; // 1 0 1   5 -> 1
            case 2: HI(qIa,Va) LO(qIc,Vc) NE(qIb,Vb) break; // 1 0 0   4 -> 2
            case 3: HI(qIb,Vb) LO(qIc,Vc) NE(qIa,Va) break; // 1 1 0   6 -> 3
            case 4: HI(qIb,Vb) LO(qIa,Va) NE(qIc,Vc) break; // 0 1 0   2 -> 4
            case 5: HI(qIc,Vc) LO(qIa,Va) NE(qIb,Vb) break; // 0 1 1   3 -> 5
            case 6: HI(qIc,Vc) LO(qIb,Vb) NE(qIa,Va) break; // 0 0 1   1 -> 6
        }

        /*
        switch (sector) // R1 right wheel
        {
            case 1: HI(qIc,Vc) LO(qIa,Va) NE(qIb,Vb) break; // 0 1 1   3 -> 5
            case 2: HI(qIc,Vc) LO(qIb,Vb) NE(qIa,Va) break; // 0 0 1   1 -> 6
            case 3: HI(qIa,Va) LO(qIb,Vb) NE(qIc,Vc) break; // 1 0 1   5 -> 1
            case 4: HI(qIa,Va) LO(qIc,Vc) NE(qIb,Vb) break; // 1 0 0   4 -> 2
            case 5: HI(qIb,Vb) LO(qIc,Vc) NE(qIa,Va) break; // 1 1 0   6 -> 3
            case 6: HI(qIb,Vb) LO(qIa,Va) NE(qIc,Vc) break; // 0 1 0   2 -> 4
        }
        */

        /*
        switch (sector) // R1 left wheel
        {
            case 1: HI(qIb,Vb) LO(qIc,Vc) NE(qIa,Va) break; // 1 1 0   6 -> 3
            case 2: HI(qIb,Vb) LO(qIa,Va) NE(qIc,Vc) break; // 0 1 0   2 -> 4
            case 3: HI(qIc,Vc) LO(qIa,Va) NE(qIb,Vb) break; // 0 1 1   3 -> 5
            case 4: HI(qIc,Vc) LO(qIb,Vb) NE(qIa,Va) break; // 0 0 1   1 -> 6
            case 5: HI(qIa,Va) LO(qIb,Vb) NE(qIc,Vc) break; // 1 0 1   5 -> 1
            case 6: HI(qIa,Va) LO(qIc,Vc) NE(qIb,Vb) break; // 1 0 0   4 -> 2
        }
        */
    }

    BOOL negative_sec = sector%2;

    int delta = 0;

    if (MotorConfig.has_hall)
    {
        if (MotorConfig.has_qe)
        {
            delta = enc - enc_start_sec;

            //gulp_delta = delta;

            if (delta >= 180) delta -= 360; else if (delta < -180) delta += 360;

            if (delta>30) delta=30; else if (delta<-30) delta=-30;
        }
    }
    else
    {
        delta = (enc%60)-30;
    }

    // back compatibility
    //delta = 0;

    int sinT,cosT;

    if (delta<0)
    {
        cosT =  cos_table[-delta];
        sinT = -sin_table[-delta];
    }
    else
    {
        cosT =  cos_table[ delta];
        sinT =  sin_table[ delta];
    }

    if (negative_sec)
    {
        I2Tdata.IQMeasured = /* sqrt3/2 */  (int)(__builtin_mulss((*iH-*iL),cosT)>>15)-3*(int)(__builtin_mulss(   *i0   ,sinT)>>15);
        I2Tdata.IDMeasured = /* 3/2 */     -(int)(__builtin_mulss(   *i0   ,cosT)>>15)-  (int)(__builtin_mulss((*iH-*iL),sinT)>>15);
    }
    else
    {
        I2Tdata.IQMeasured = /* sqrt3/2 */  (int)(__builtin_mulss((*iH-*iL),cosT)>>15)+3*(int)(__builtin_mulss(  *i0    ,sinT)>>15);
        I2Tdata.IDMeasured = /* 3/2 */      (int)(__builtin_mulss(   *i0   ,cosT)>>15)-  (int)(__builtin_mulss((*iH-*iL),sinT)>>15);
    }

    if (!sAlignInProgress)
    {
        if (gControlMode == icubCanProto_controlmode_speed_current
         || gControlMode == icubCanProto_controlmode_speed_voltage)
        {
            if (has_speed_sample)
            {
                int speed_error = CtrlReferences.WRef - gQEVelocity;

                if (gControlMode == icubCanProto_controlmode_speed_current)
                {
                    Is += (((long) (speed_error - speed_error_old)) << 4) + (long) (speed_error + speed_error_old);

                    if (Is > Ipeak) Is = Ipeak; else if (Is < -Ipeak) Is = -Ipeak;

                    if (starting)
                    {
                        if (Is > 0)
                        {
                            if (Is > IqRef) ++IqRef; else { IqRef = (int)Is; starting = FALSE; }
                        }
                        else
                        {
                            if (Is < IqRef) --IqRef; else { IqRef = (int)Is; starting = FALSE; }
                        }
                    }
                    else
                    {
                        IqRef = (int)Is;
                    }
                }
                else
                {
                  //VqRef += (((long) (speed_error - speed_error_old)) << 8) + ((long) (speed_error + speed_error_old)<<2);
                    VqRef += __builtin_mulss(speed_error-speed_error_old,SKp) + __builtin_mulss(speed_error + speed_error_old,SKi);

                    if (VqRef > SIntLimit) VqRef = SIntLimit; else if (VqRef < -SIntLimit) VqRef = -SIntLimit;

                    IqRef = 0;
                }

                speed_error_old = speed_error;
            } // has_speed_sample
        }
        else if (gControlMode == icubCanProto_controlmode_current)
        {
            VqRef = 0;
            IqRef = CtrlReferences.IqRef;

            if (IqRef>Ipeak) IqRef = Ipeak; else if (IqRef<-Ipeak) IqRef = -Ipeak;
        }
        else if (gControlMode == icubCanProto_controlmode_openloop)
        {
            VqRef = ((long)CtrlReferences.VqRef)<<(IKs-VOLT_REF_SHIFT);
            IqRef = 0;
        }
        else
        {
            VqRef = 0;
            IqRef = 0;
        }
    }
    ////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////////////
    // Iq control loop

